---
type: RebarShapeConstraintSagittaLength
namespace: Autodesk.Revit.DB.Structure
version: 2024
members: 1
tags: [revit-api, class]
---

# RebarShapeConstraintSagittaLength

`Autodesk.Revit.DB.Structure.RebarShapeConstraintSagittaLength` · Revit 2024 · 1 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Constructor | RebarShapeConstraintSagittaLength | 2012 | `public RebarShapeConstraintSagittaLength ( ElementId paramId )` |